In [1]:
#Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#Loading Data
dataset= load_dataset('lukebarousse/data_jobs')
df=dataset['train'].to_pandas()

#Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [2]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [5]:
median_salary_year=df['salary_year_avg'].median()
print(f'Median Salary Year: {median_salary_year}')

Median Salary Year: 115000.0

In [6]:
median_salary_hour=df['salary_hour_avg'].median()
print(f'Median Salary Hour: {median_salary_hour}')

Median Salary Hour: 45.97999954223633

In [10]:
#create new dataframe 
df_filled = df

df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [11]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [19]:
# Overview:
# This block of code aims to identify and remove duplicate rows from a DataFrame.
# 1. A new reference 'df_unique' is created, initially pointing to 'df_filled'.
# 2. Duplicate rows are removed from 'df_unique'. Note that `drop_duplicates()`
#    returns a new DataFrame, which is reassigned to 'df_unique'.
# 3. The script then prints the original length of 'df_filled', the length
#    of 'df_unique' after removing duplicates, and the difference, showing
#    how many rows were dropped.

df_unique = df_filled
df_unique = df_unique.drop_duplicates()

print('Length of original dataframe:', len(df_filled))
print('Length of unique dataframe:', len(df_unique))
print('Rows Dropped:', len(df_filled) - len(df_unique))

Length of original dataframe: 785741
Length of unique dataframe: 785640
Rows Dropped: 101

In [20]:
# Overview:
# This block refines the 'df_unique' DataFrame by removing duplicate rows
# based specifically on the combination of values in the 'job_title' and
# 'company_name' columns. Rows are considered duplicates only if both
# the job title and company name are identical to another row.
# 1. Duplicate rows (based on the specified subset of columns) are removed
#    from 'df_unique'. The result overwrites the 'df_unique' variable.
# 2. The script then prints the original length of 'df_filled' (which was
#    the source before any deduplication), the length of 'df_unique' after
#    this specific deduplication step, and the total number of rows dropped
#    since the original 'df_filled' state.

df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print('Length of original dataframe:', len(df_filled))
print('Length of unique dataframe:', len(df_unique))
print('Rows Dropped:', len(df_filled) - len(df_unique))

df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])
print('Length of original dataframe:', len(df_filled))
print('Length of unique dataframe:', len(df_unique))
print('Rows Dropped:', len(df_filled)-len(df_unique))

Length of original dataframe: 785741
Length of unique dataframe: 508042
Rows Dropped: 277699
Length of original dataframe: 785741
Length of unique dataframe: 508042
Rows Dropped: 277699